""" Наборы тестовых данных """

reg_name = (('Пусто', ''),
        ('Один символ', 'ю'),
        ('10 пробелов', '          '),
        ('31 символ', 'ааааабббббвввввгггггдддддеееееж'),
        ('256 символов', 'ааааааааааббббббббббввввввввввггггггггггддддддддддеееееееееежжжжжжжжжжззззззззззииииииииииккккккккккллллллллллммммммммммннннннннннооооооооооппппппппппррррррррррссссссссссттттттттттууууууууууффффффффффааааааааааббббббббббввввввввввггггггггггддддддддддхххххх'),
        ('Латинские буквы', 'abcdefgh'),
        ('Спецсимволы', '@#$%^&*!')
        )

